# Pandas Basics

In [1]:
import pandas as pd
import numpy as np

#### Working with Pandas Series

In [3]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a':100, 'b':200, 'c':300}

In [4]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(data = arr, index = labels)

a    10
b    20
c    30
dtype: int32

In [7]:
# when a dictionary is passed, automatically takes keys as index and values as data
pd.Series(d)

a    100
b    200
c    300
dtype: int64

In [8]:
# pandas series can store any type of data objects
pd.Series(data = [sum, len, min, max])

0    <built-in function sum>
1    <built-in function len>
2    <built-in function min>
3    <built-in function max>
dtype: object

In [11]:
ser1 = pd.Series([1, 2, 3, 4], ['USA', 'Germany', 'Italy', 'Japan'])
ser1

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [12]:
ser2 = pd.Series([1, 2, 5, 4], ['USA', 'Germany', 'New York', 'Japan'])
ser2

USA         1
Germany     2
New York    5
Japan       4
dtype: int64

In [13]:
ser1 + ser2
# NOTE: the integer are converted into float implicitly by pandas so that we don't loose any data

Germany     4.0
Italy       NaN
Japan       8.0
New York    NaN
USA         2.0
dtype: float64

In [14]:
# For accessing elements in pandas series, index is used
ser1['Germany']

2

#### Working with DataFrames

The Basic idea of DataFrames is several series arranged column wise

In [3]:
from numpy.random import randn
np.random.seed(101)

In [5]:
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['X', 'Y', 'Z', 'W'])
df

          X         Y         Z         W
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [6]:
# Column Selection can be done using [] and . notation
# But it is recommended to use [] notation
df['X']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: X, dtype: float64

In [7]:
# For selecting multiple columns, pass a list containing names of columns we wanted to select
df[['X', 'Z']]

          X         Z
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [8]:
# Create new column
df['new'] = df['X'] + df['Y']
df

          X         Y         Z         W       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [10]:
# Dropping a column : drop method is used
df.drop('new', axis = 1)  # axis = 1 means selecting column, axis = 0(default) means selecting row
# NOTE: the df is not modified unless we use inplace=True

          X         Y         Z         W
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
df

          X         Y         Z         W       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [12]:
df.drop('new', axis = 1, inplace = True)

In [13]:
df

          X         Y         Z         W
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
df.drop('E')

          X         Y         Z         W
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [15]:
type(df)

pandas.core.frame.DataFrame

In [16]:
type(df['X'])

pandas.core.series.Series

In [19]:
# Selection of rows can be done using 2 functions: loc[] and iloc[]
# loc[] is used to access on the basis of label based indexing whereas iloc[] uses integer based indexing
df.loc['B']

X    0.651118
Y   -0.319318
Z   -0.848077
W    0.605965
Name: B, dtype: float64

In [21]:
df.iloc[1]
# NOTE: iloc[] doesn't care about existance of label based indexing

X    0.651118
Y   -0.319318
Z   -0.848077
W    0.605965
Name: B, dtype: float64

DataFrame Subset selection

In [23]:
df.loc['B','Y']

-0.31931804459303326

In [25]:
df.loc[['A', 'C'], ['X', 'Z']]

          X         Z
A  2.706850  0.907969
C -2.018168  0.528813

Conditional Selection in Pandas

In [26]:
df > 0

       X      Y      Z      W
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [27]:
df[df > 0]

          X         Y         Z         W
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df[df['X'] > 0]
# Selects the rows(pandas series) for which column X > 0
# NOTE: we don't get a NaN here as we completely dicard the row

          X         Y         Z         W
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df[df['X'] > 0]['Y']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: Y, dtype: float64

In [31]:
df[df['X'] > 0][['Y', 'Z']]

          Y         Z
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [36]:
# The above one line statement is equivalent to the given line of code
booldf = df['X'] > 0
tempdf = df[booldf]
tempdf[['Y', 'Z']]

          Y         Z
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [37]:
# For applying multiple conditions, we use logical connectives such as &(for and), |(for or)
# NOTE: we never use 'and' and 'or' operators as logical connectives because each statement is a python
# series and 'and' 'or' works only for atomic boolean values
df[(df['X'] > 0) & (df['Y'] > 1)]

          X         Y         Z         W
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df[(df['X'] > 0) | (df['Y'] > 1)]

          X         Y         Z         W
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Managing Indexes
reset_index(): used to reset index to integer index
set_index(colm): used to make colm as index

In [39]:
df.reset_index()

  index         X         Y         Z         W
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [42]:
states = "UP MP DL RJ GU".split()
df['States'] = states
df

          X         Y         Z         W States
A  2.706850  0.628133  0.907969  0.503826     UP
B  0.651118 -0.319318 -0.848077  0.605965     MP
C -2.018168  0.740122  0.528813 -0.589001     DL
D  0.188695 -0.758872 -0.933237  0.955057     RJ
E  0.190794  1.978757  2.605967  0.683509     GU

In [43]:
df.set_index('States')

               X         Y         Z         W
States
UP      2.706850  0.628133  0.907969  0.503826
MP      0.651118 -0.319318 -0.848077  0.605965
DL     -2.018168  0.740122  0.528813 -0.589001
RJ      0.188695 -0.758872 -0.933237  0.955057
GU      0.190794  1.978757  2.605967  0.683509